In [136]:
import pandas as pd

In [137]:
!pip install html5lib

Requirement already satisfied: html5lib in c:\users\lenovo\anaconda3\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\users\lenovo\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\lenovo\anaconda3\lib\site-packages (from html5lib) (0.5.1)

# Beans

In [138]:
tb1 = pd.read_html('beans kolphapur.xls')
df1 = tb1[0]
df1['Variety'] = df1['Variety'].str.replace('Other','Beans')
df1.head(3)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2000,3500,2800,23 Mar 2025,Local
1,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2500,2800,2600,19 Aug 2025,Local
2,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2800,3500,3000,03 Jun 2025,Local

In [139]:
tb2 = pd.read_html('beans pune.xls')
df2 = tb2[0]
df2['Variety'] = df2['Variety'].str.replace('Other','Beans')
df2.head(3)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Pune,Manchar,Beans,Pulses,0.1,5000,7000,6000,01 May 2025,Local
1,Maharashtra,Pune,Manchar,Beans,Pulses,0.1,7500,7500,7500,18 May 2025,Local
2,Maharashtra,Pune,Manchar,Beans,Pulses,0.1,8000,8000,8000,21 May 2025,Local

In [140]:
tb3 = pd.read_html('beans nashik.xls')
df3 = tb3[0]
df3['Variety'] = df3['Variety'].str.replace('Other','Beans')
df3.head(3)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Nashik,Nasik,Beans,Pulses,0.9,1000,3000,2100,17 Jan 2025,FAQ
1,Maharashtra,Nashik,Nasik,Beans,Pulses,2.3,8000,12000,10000,07 Jul 2025,Local
2,Maharashtra,Nashik,Nasik,Beans,Pulses,2.3,9000,13000,11500,06 Jul 2025,Local

In [141]:
tb4 = pd.read_html('beans thane.xls')
df4= tb4[0]
df4['Variety'] = df4['Variety'].str.replace('Other','Beans')
df4.head(3)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Thane,Kalyan,Beans,Pulses,0.3,1000,1200,1100,07 Jul 2025,Local
1,Maharashtra,Thane,Kalyan,Beans,Pulses,0.3,1000,1200,1100,08 Jul 2025,Local
2,Maharashtra,Thane,Kalyan,Beans,Pulses,0.3,1000,2000,1500,04 Jan 2025,FAQ

In [142]:
tb5 = pd.read_html('beans ahamadnager.xls')
df5 = tb5[0]
df5['Variety'] = df5['Variety'].str.replace('Other','Beans')
df5.head(3)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Ahmednagar,Rahata,Beans,Pulses,0.1,2000,2000,2000,01 Feb 2025,Local
1,Maharashtra,Ahmednagar,Rahata,Beans,Pulses,0.1,2000,2000,2000,05 Apr 2025,Local
2,Maharashtra,Ahmednagar,Rahata,Beans,Pulses,0.1,2000,2000,2000,13 Feb 2025,Local

# Brinjal

In [143]:
tb6 = pd.read_html('brinjal ahamadnager.xls')
df6 = tb6[0]
df6['Variety'] = df6['Variety'].str.replace('Other','Brinjal')
df6.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Ahmednagar,Rahata,Brinjal,Vegetables,0.1,500,500,500,26 Feb 2025,Local
1,Maharashtra,Ahmednagar,Rahata,Brinjal,Vegetables,0.2,1000,3800,2500,20 Jun 2025,Local

In [144]:
tb7 = pd.read_html('brinjal pune.xls')
df7 = tb7[0]
df7['Variety'] = df7['Variety'].str.replace('Other','Brinjal')
df7.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Pune,Manchar,Brinjal,Vegetables,0.5,1900,3000,2500,29 Jul 2025,Local
1,Maharashtra,Pune,Manchar,Brinjal,Vegetables,0.6,1750,3000,2400,01 Aug 2025,Local

In [145]:
tb8 = pd.read_html('brinjal nashik.xls')
df8 = tb8[0]
df8['Variety'] = df8['Variety'].str.replace('Other','Brinjal')
df8.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Nashik,Nasik,Brinjal,Vegetables,4.0,2500,4000,3400,30 Jan 2025,Local
1,Maharashtra,Nashik,Nasik,Brinjal,Vegetables,4.7,1000,4000,3000,18 Mar 2025,Local

In [146]:
tb9 = pd.read_html('brinjal ch-s.xls')
df9 = tb9[0]
df9['Variety'] = df9['Variety'].str.replace('Other','Brinjal')
df9.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Brinjal,Vegetables,1.2,600,800,700,31 Mar 2025,Local
1,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Brinjal,Vegetables,1.3,3000,3500,3250,30 Jun 2025,Local

In [147]:
tb10 = pd.read_html('brinjal thane.xls')
df10 = tb10[0]
df10['Variety'] = df10['Variety'].str.replace('Other','Brinjal')
df10['Group'] = df10['Group'].str.replace('Pulses','Vegetables')

df10.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Thane,Kalyan,Brinjal,Vegetables,0.3,1000,1200,1100,07 Jul 2025,Local
1,Maharashtra,Thane,Kalyan,Brinjal,Vegetables,0.3,1000,1200,1100,08 Jul 2025,Local

In [148]:
tb11 = pd.read_html('brinjal kolhapur.xls')
df11 = tb11[0]
df11['Variety'] = df11['Variety'].str.replace('Other','Brinjal')
df11.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Kolhapur,Vadgaonpeth,Brinjal,Vegetables,0.6,2500,3500,2800,30 Jan 2025,Local
1,Maharashtra,Kolhapur,Vadgaonpeth,Brinjal,Vegetables,0.7,2000,3000,2700,04 Mar 2025,Local

In [149]:
tb12 = pd.read_html('brinjal chandrapur.xls')
df12 = tb12[0]
df12['Variety'] = df12['Variety'].str.replace('Other','Brinjal')
df12.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Brinjal,Vegetables,0.6,500,1000,800,20 Feb 2025,Local
1,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Brinjal,Vegetables,0.9,1000,2000,1500,05 Jun 2025,Local

# cabbage

In [150]:
tb13 = pd.read_html('cabbage ahamadnager.xls')
df13 = tb13[0]
df13['Variety'] = df13['Variety'].str.replace('Other','Cabbage')
df13.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Ahmednagar,Rahuri,Cabbage,Vegetables,0.3,1000,1500,1250,06 Jul 2025,Local
1,Maharashtra,Ahmednagar,Rahuri,Cabbage,Vegetables,0.4,400,800,600,16 Apr 2025,Local

In [151]:
tb14 = pd.read_html('cabbage pune.xls')
df14 = tb14[0]
df14['Variety'] = df14['Variety'].str.replace('Other','Cabbage')
df14.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Pune,Manchar,Cabbage,Vegetables,3.8,1000,1600,1325,16 Jun 2025,Local
1,Maharashtra,Pune,Manchar,Cabbage,Vegetables,4.5,1000,1200,1100,12 Jun 2025,Local

In [152]:
tb15 = pd.read_html('cabbage nashik.xls')
df15 = tb15[0]
df15['Variety'] = df15['Variety'].str.replace('Other','Cabbage')
df15.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Nashik,Nasik,Cabbage,Vegetables,7.8,1040,2085,1335,06 Jul 2025,Local
1,Maharashtra,Nashik,Nasik,Cabbage,Vegetables,16.5,500,1500,1000,19 Jul 2025,Local

In [153]:
tb16 = pd.read_html('cabbage thane.xls')
df16 = tb16[0]
df16['Variety'] = df16['Variety'].str.replace('Other','Cabbage')
df16.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Thane,Kalyan,Cabbage,Vegetables,0.3,300,400,350,29 Apr 2025,Local
1,Maharashtra,Thane,Kalyan,Cabbage,Vegetables,0.3,300,500,400,08 Mar 2025,Local

In [154]:
tb17 = pd.read_html('cabbage ch-s.xls')
df17 = tb17[0]
df17['Variety'] = df17['Variety'].str.replace('Other','Cabbage')
df17.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Cabbage,Vegetables,1.3,400,600,500,06 Apr 2025,Local
1,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Cabbage,Vegetables,2.4,800,1000,900,07 Jun 2025,Local

In [155]:
tb18 = pd.read_html('cabbage kolhapur.xls')
df18 = tb18[0]
df18['Variety'] = df18['Variety'].str.replace('Other','Cabbage')
df18.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Kolhapur,Kolhapur,Cabbage,Vegetables,5.1,300,500,400,15 Mar 2025,Local
1,Maharashtra,Kolhapur,Kolhapur,Cabbage,Vegetables,5.1,600,800,700,29 Apr 2025,Local

In [156]:
tb19 = pd.read_html('cabbage chandrapur.xls')
df19 = tb19[0]
df19['Variety'] = df19['Variety'].str.replace('Other','Cabbage')
df19.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chandrapur,Chandrapur,Cabbage,Vegetables,6.1,800,1500,1000,13 Aug 2025,Local
1,Maharashtra,Chandrapur,Chandrapur,Cabbage,Vegetables,7.6,500,1000,700,07 Jan 2025,FAQ

# cucumber

In [157]:
tb20 = pd.read_html('cucumber chandrapur.xls')
df20 = tb20[0]
df20['Variety'] = df20['Variety'].str.replace('Other','Cabbage')
df20.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Cabbage,Vegetables,0.4,1000,2000,1500,31 Jan 2025,Local
1,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Cabbage,Vegetables,0.4,2000,3500,3000,12 Jan 2025,FAQ

In [158]:
tb21 = pd.read_html('cucumber pune.xls')
df21 = tb21[0]
df21['Variety'] = df21['Variety'].str.replace('Other','Cabbage')
df21.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Pune,Manchar,Cabbage,Vegetables,0.6,300,700,500,19 Aug 2025,Local
1,Maharashtra,Pune,Manchar,Cabbage,Vegetables,0.6,1500,2250,1900,26 Mar 2025,Local

In [159]:
tb22 = pd.read_html('cucumber nashik.xls')
df22 = tb22[0]
df22['Variety'] = df22['Variety'].str.replace('Other','Cabbage')
df22.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Nashik,Nasik,Cabbage,Vegetables,1.1,1000,2000,1500,22 Mar 2025,Local
1,Maharashtra,Nashik,Nasik,Cabbage,Vegetables,1.1,1250,2250,1750,14 Mar 2025,Local

In [160]:
tb23 = pd.read_html('cucumber ch-s.xls')
df23 = tb23[0]
df23['Variety'] = df23['Variety'].str.replace('Other','Cabbage')
df23.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Cabbage,Vegetables,3.0,500,1400,950,07 Jul 2025,Local
1,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Cabbage,Vegetables,3.1,500,1400,950,31 Mar 2025,Local

In [161]:
tb24 = pd.read_html('cucumber thane.xls')
df24 = tb24[0]
df24['Variety'] = df24['Variety'].str.replace('Other','Cabbage')
df24.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Thane,Kalyan,Cabbage,Vegetables,0.3,500,1500,1000,08 Aug 2025,Local
1,Maharashtra,Thane,Kalyan,Cabbage,Vegetables,0.3,500,1500,1000,09 Aug 2025,Local

In [162]:
tb25 = pd.read_html('cucumber ahamadnager.xls')
df25 = tb25[0]
df25['Variety'] = df25['Variety'].str.replace('Other','Cabbage')
df25.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Ahmednagar,Rahuri(Songaon),Cabbage,Vegetables,0.2,1000,2500,1750,21 Jan 2025,FAQ
1,Maharashtra,Ahmednagar,Rahuri(Songaon),Cabbage,Vegetables,0.2,1500,2500,2000,04 Feb 2025,Local

In [163]:
tb26 = pd.read_html('cucumber kolhapur.xls')
df26 = tb26[0]
df26['Variety'] = df26['Variety'].str.replace('Other','Cabbage')
df26.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Kolhapur,Vadgaonpeth,Cabbage,Vegetables,0.3,1000,2000,1600,04 Apr 2025,Local
1,Maharashtra,Kolhapur,Vadgaonpeth,Cabbage,Vegetables,0.6,1000,1500,1200,22 Apr 2025,Local

# garlic

In [164]:
tb27 = pd.read_html('garlic chandrapur.xls')
df27 = tb27[0]
df27['Variety'] = df27['Variety'].str.replace('Other','Garlic')
df27.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Garlic,Spices,0.2,8000,8000,8000,08 Aug 2025,Local
1,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Garlic,Spices,0.3,7000,8000,7500,18 Aug 2025,Local

In [165]:
tb28 = pd.read_html('garlic thane.xls')
df28 = tb28[0]
df28['Variety'] = df28['Variety'].str.replace('Other','Garlic')
df28.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Thane,Kalyan,Garlic,Spices,0.3,1000,2000,1500,17 Jan 2025,FAQ
1,Maharashtra,Thane,Kalyan,Garlic,Spices,0.3,2000,7000,4500,12 Aug 2025,Local

In [166]:
tb29 = pd.read_html('garlic pune.xls')
df29 = tb29[0]
df29['Variety'] = df29['Variety'].str.replace('Other','Garlic')
df29.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Pune,Manchar,Garlic,Spices,0.1,4000,7000,5625,24 Feb 2025,Local
1,Maharashtra,Pune,Manchar,Garlic,Spices,0.1,5000,5000,5000,30 Jul 2025,Local

In [167]:
tb30 = pd.read_html('garlic nashik.xls')
df30 = tb30[0]
df30['Variety'] = df30['Variety'].str.replace('Other','Garlic')
df30.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Nashik,Nasik,Garlic,Spices,0.3,4800,13000,7600,19 Aug 2025,Local
1,Maharashtra,Nashik,Nasik,Garlic,Spices,0.3,7200,17500,13000,17 Jan 2025,FAQ

# onion

In [168]:
tb31 = pd.read_html('onion ahamadnager.xls')
df31 = tb31[0]
df31['Variety'] = df31['Variety'].str.replace('Other','Onion')
df31.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Ahmednagar,Rahata,Onion,Vegetables,72.9,400,1800,1350,14 Mar 2025,Local
1,Maharashtra,Ahmednagar,Rahata,Onion,Vegetables,114.1,400,1500,1150,20 Apr 2025,Local

In [169]:
tb32 = pd.read_html('onion pune.xls')
df32 = tb32[0]
df32['Variety'] = df32['Variety'].str.replace('Other','Onion')
df32.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Pune,Manchar,Onion,Vegetables,326.7,1500,1850,1700,22 Jul 2025,Local
1,Maharashtra,Pune,Manchar,Onion,Vegetables,552.2,1700,2110,1905,26 Jun 2025,Local

In [170]:
tb33 = pd.read_html('onion nashik.xls')
df33 = tb33[0]
df33['Variety'] = df33['Variety'].str.replace('Other','Onion')
df33.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Nashik,Lasalgaon(Vinchur),Onion,Vegetables,373.5,600,2001,1100,30 Apr 2025,Local
1,Maharashtra,Nashik,Lasalgaon(Vinchur),Onion,Vegetables,384.4,600,1351,1160,14 Apr 2025,Local

In [192]:
tb34 = pd.read_html('onion ch-s.xls')
df34 = tb34[0]
df34['Variety'] = df34['Variety'].str.replace('Other','Onion')
df34.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chattrapati Sambhajinagar,Paithan,Onion,Vegetables,1.4,370,750,715,01 May 2025,Local
1,Maharashtra,Chattrapati Sambhajinagar,Paithan,Onion,Vegetables,2.0,1010,1010,1010,26 Apr 2025,Local

In [172]:
tb35 = pd.read_html('onion kolhapur.xls')
df35 = tb35[0]
df35['Variety'] = df35['Variety'].str.replace('Local','Onion')
df35.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Kolhapur,Vadgaonpeth,Onion,Vegetables,2.6,2000,3000,2200,20 Feb 2025,Local
1,Maharashtra,Kolhapur,Vadgaonpeth,Onion,Vegetables,5.0,2500,3500,2800,10 Jan 2025,FAQ

# Potato

In [173]:
tb36 = pd.read_html('potato ahamadnager.xls')
df36 = tb36[0]
df36['Variety'] = df36['Variety'].str.replace('Other','Potato')
df36.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Ahmednagar,Rahata,Potato,Vegetables,0.1,3002,3002,3002,05 Aug 2025,Local
1,Maharashtra,Ahmednagar,Rahata,Potato,Vegetables,1.0,500,1800,1100,31 Jan 2025,Local

In [174]:
tb37 = pd.read_html('potato pune.xls')
df37 = tb37[0]
df37['Variety'] = df37['Variety'].str.replace('Other','Potato')
df37.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Thane,Kalyan,Potato,Vegetables,0.3,500,1500,1000,08 Aug 2025,Local
1,Maharashtra,Thane,Kalyan,Potato,Vegetables,0.3,500,1500,1000,09 Aug 2025,Local

In [175]:
tb38 = pd.read_html('potato ch-s.xls')
df38 = tb38[0]
df38['Variety'] = df38['Variety'].str.replace('Other','Potato')
df38.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Potato,Vegetables,77.0,1100,1700,1400,23 Jul 2025,Local
1,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Potato,Vegetables,88.0,1400,2000,1700,05 Jun 2025,Local

In [176]:
tb39 = pd.read_html('potato nashik.xls')
df39 = tb39[0]
df39['Variety'] = df39['Variety'].str.replace('Other','Potato')
df39.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Nashik,Nasik,Potato,Vegetables,64.5,1400,1950,1700,29 May 2025,Local
1,Maharashtra,Nashik,Nasik,Potato,Vegetables,69.3,1500,2100,1800,04 Jun 2025,Local

In [177]:
tb40 = pd.read_html('potato chandrapur.xls')
df40 = tb40[0]
df40['Variety'] = df40['Variety'].str.replace('Other','Potato')
df40.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Potato,Vegetables,10.4,1700,1900,1800,09 Jul 2025,Local
1,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Potato,Vegetables,20.0,1500,2000,1800,21 Feb 2025,Local

In [178]:
tb41 = pd.read_html('potato kolhapur.xls')
df41 = tb41[0]
df41['Variety'] = df41['Variety'].str.replace('Local','Potato')
df41.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Kolhapur,Vadgaonpeth,Potato,Vegetables,0.9,1800,2300,2000,12 Jul 2025,Local
1,Maharashtra,Kolhapur,Vadgaonpeth,Potato,Vegetables,1.0,1800,2600,2000,19 Apr 2025,Local

# Tomato

In [179]:
tb42 = pd.read_html('tomato ahamadnager.xls')
df42 = tb42[0]
df42['Variety'] = df42['Variety'].str.replace('Other','Tomato')
df42.head(3)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Ahmednagar,Rahata,Tomato,Vegetables,0.6,500,2100,1300,11 Jun 2025,Local
1,Maharashtra,Ahmednagar,Rahata,Tomato,Vegetables,0.8,2000,6000,4000,16 Aug 2025,Local
2,Maharashtra,Ahmednagar,Rahata,Tomato,Vegetables,0.9,200,500,350,31 Jan 2025,Local

In [180]:
tb43 = pd.read_html('tomato nashik.xls')
df43 = tb43[0]
df43['Variety'] = df43['Variety'].str.replace('Other','Tomato')
df43.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Nashik,Nasik,Tomato,Vegetables,17.0,1600,4800,3000,21 Jan 2025,FAQ
1,Maharashtra,Nashik,Nasik,Tomato,Vegetables,18.5,400,950,850,23 Mar 2025,Local

In [181]:
tb44 = pd.read_html('tomato pune.xls')
df44 = tb44[0]
df44['Variety'] = df44['Variety'].str.replace('Other','Tomato')
df44.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Pune,Manchar,Tomato,Vegetables,0.1,1000,2000,1500,03 Mar 2025,Local
1,Maharashtra,Pune,Manchar,Tomato,Vegetables,0.1,1000,2500,1750,04 May 2025,Local

In [182]:
tb45 = pd.read_html('tomato chandrapur.xls')
df45 = tb45[0]
df45['Variety'] = df45['Variety'].str.replace('Other','Tomato')
df45.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Tomato,Vegetables,1.5,2000,3200,2500,30 Jul 2025,Local
1,Maharashtra,Chandrapur,Chandrapur(Ganjwad),Tomato,Vegetables,15.0,400,600,500,28 Feb 2025,Local

In [183]:
tb46 = pd.read_html('tomato ch-s.xls')
df46 = tb46[0]
df46['Variety'] = df46['Variety'].str.replace('Other','Tomato')
df46.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Tomato,Vegetables,8.5,550,750,650,23 Jan 2025,FAQ
1,Maharashtra,Chattrapati Sambhajinagar,Chattrapati Sambhajinagar,Tomato,Vegetables,8.9,1500,2500,2000,11 Jun 2025,Local

In [184]:
tb47 = pd.read_html('tomato thane.xls')
df47 = tb47[0]
df47['Variety'] = df47['Variety'].str.replace('Other','Tomato')
df47.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Thane,Kalyan,Tomato,Vegetables,0.3,250,400,325,27 Jun 2025,Local
1,Maharashtra,Thane,Kalyan,Tomato,Vegetables,0.3,250,400,325,28 Jun 2025,Local

In [185]:
tb48 = pd.read_html('tomato kolphapur.xls')
df48 = tb48[0]
df48['Variety'] = df48['Variety'].str.replace('Local','Tomato')
df48.head(2)

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Kolhapur,Vadgaonpeth,Tomato,Vegetables,2.6,700,1200,1000,22 Feb 2025,Local
1,Maharashtra,Kolhapur,Vadgaonpeth,Tomato,Vegetables,2.6,800,1300,1000,20 May 2025,Local

# concatenating

In [186]:
import pandas as pd

def concat_dataframes(n=48):
    """
    Concatenate DataFrames named df1, df2, ..., dfN into a single DataFrame.

    Parameters:
        n (int): The number of DataFrames to check (default = 48).
                 For example, if n=48, it looks for df1, df2, ..., df48.

    Returns:
        pd.DataFrame: A concatenated DataFrame containing all the found DataFrames.
                      Returns an empty DataFrame if none are found.
    """
    
    dfs = []  # this list will store all the found DataFrames
    
    # Loop from 1 to n (inclusive)
    for i in range(1, n+1):
        var_name = f"df{i}"  # construct variable name like 'df1', 'df2', etc.
        
        # Check if this variable exists in the current global namespace
        if var_name in globals():
            dfs.append(globals()[var_name])  # add the DataFrame to our list
        else:
            print(f" Skipping {var_name} (not found)")  # warning if DataFrame doesn't exist
    
    # After collecting all available DataFrames
    if dfs:  # only concatenate if the list is not empty
        main_df = pd.concat(dfs, ignore_index=True)  # stack them together into one DataFrame
        return main_df
    else:
        print(" No DataFrames found to concatenate.")
        return pd.DataFrame()  # return empty DataFrame if nothing found


#  Usage
main_df = concat_dataframes(48)  # will try to concatenate df1 ... df48

In [187]:
main_df.head()

,State Name,District Name,Market Name,Variety,Group,Arrivals (Tonnes),Min Price (Rs./Quintal),Max Price (Rs./Quintal),Modal Price (Rs./Quintal),Reported Date,Grade
0,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2000,3500,2800,23 Mar 2025,Local
1,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2500,2800,2600,19 Aug 2025,Local
2,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2800,3500,3000,03 Jun 2025,Local
3,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2800,3500,3000,12 Apr 2025,Local
4,Maharashtra,Kolhapur,Vadgaonpeth,Beans,Pulses,0.3,2800,3500,3000,30 Jan 2025,Local

In [188]:
main_df.shape

(6817, 11)

In [189]:
main_df['Group'].unique()

array(['Pulses', 'Vegetables', 'Spices'], dtype=object)

In [190]:
main_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6817 entries, 0 to 6816
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   State Name                 6817 non-null   object
 1   District Name              6817 non-null   object
 2   Market Name                6817 non-null   object
 3   Variety                    6817 non-null   object
 4   Group                      6817 non-null   object
 5   Arrivals (Tonnes)          6817 non-null   float64
 6   Min Price (Rs./Quintal)    6817 non-null   int64
 7   Max Price (Rs./Quintal)    6817 non-null   int64
 8   Modal Price (Rs./Quintal)  6817 non-null   int64
 9   Reported Date              6817 non-null   object
 10  Grade                      6817 non-null   object
dtypes: float64(1), int64(3), object(7)
memory usage: 586.0+ KB

In [193]:
# Save main_df to a CSV file
main_df.to_csv("Final_Agmarknet.csv", index=False)